manuals/mysql.tex
% Created 2015-04-25 Sat 11:20
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Joshua Branson}
\date{\today}
\title{SQL Manual}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents



\section{DataTypes}
\label{sec-1}

MySQL comes with 4 groups of data types:

\begin{itemize}
\item Numbers
\item Text
\item Date and Time
\item Defined groups
\end{itemize}

\subsection{The Numbers group has 1 group called integers.  These numbers can be used to utilize MySQL’s math functions:}
\label{sec-1-1}
\begin{itemize}
\item TINYINT   (-120 - 120)            or (0 - 255)
\item SMALLINT  (-32,000 - 32,000       or (0 - 65,000)
\item MEDIUMINT (-8 million- 8 million) or (0 - 16 million)
\item INT
\item BIGINT
\end{itemize}

Any of those types can be signed up unsigned.  \textbf{Signed} means the integer can be hold negative of or positive values.
\textbf{Unsigned} means the integer can only be positive.

MySQL also supports Numeric and Decimal data Types, which are data types that store numbers, but once stored cannot be changed.
This is a safety feature.  Suppose you want to store valuable numerical data, but do not want someone accidentally changed via a
MySQL’s mathematical function.

Float and double are also there.  They are for numbers like 5.23409348.  For comparision of equality of numbers, float is the
best option.

\subsection{Representing Text}
\label{sec-1-2}

Text has a couple of ways to be put in a MySQL database.

\begin{itemize}
\item Char      (a contstant length of a string, that will next change.  It can be between 1-255 characters long).
\item varchar   (a string that might change.  It can be between 1-255 characters long).
\item text      (a long string that might change)
\item blob      (a long string that might change)
\end{itemize}

With both char and varchar, you can specify an upper limit of what the string might be.  For example, you can specify that for
all of your varchars in a particuar table are only going to store the news headlines that are not quite finished as articles.
The title may change, but you will probably not ever see a title that is 255 chars long.  You could make the maximum to be 70
chars long.

You can also do the same for a char, and specify the longest it will ever be in a table as well.  This speeds up access time!

Blob types are case sensitive.  So MySQL will order Johnny, jOhnny, joHnny, johNny, johnNy, johnnY a very certain way, but
text types will see no differance between those names.

You can choose from

\begin{itemize}
\item tinytext and tinyblob
\item text and blob
\item mediumtext and mediumblob
\item longtext and longblob
\end{itemize}

\subsection{time and date in MySQL}
\label{sec-1-3}

here in the format:

<YEAR>-<MONTH>-<Day> <Hour>-<Minutes>-<Seconds>

\subsection{Set ond enum types}
\label{sec-1-4}

These are like structs in C.  You can group several different types inside on thing.

\section{Inserting data into tables}
\label{sec-2}

\begin{itemize}
\item INSERT \ldots{}  VALUES

-- INSERT INTO  <table$_{\text{name}}$>  [<column$_{\text{name1}}$>[,column$_{\text{name2}}$, \ldots{}]  VALUES  <column$_{\text{value1}}$>[, <column$_{\text{value2}}$>,\ldots{}];

\item INSERT \ldots{}  SET

-- INSERT INTO <table$_{\text{name}}$>
   SET <column$_{\text{name}}$>=<column$_{\text{value}}$>[, <column$_{\text{name}}$>=<column$_{\text{value}}$>,\ldots{}];

\item INSERT \ldots{}  SELECT

-- INSERT INTO <table$_{\text{name}}$> [column$_{\text{name1[}}$, column$_{\text{name2}}$,\ldots{}]
   SELECT <select$_{\text{value}}$> FROM <table$_{\text{name}}$>;
\end{itemize}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
